src/toir_cfe/src/InformationRegisters/проф_СравненияОстатковРазница/проф_СравненияОстатковРазница.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7630ee8b-baf5-4204-b76e-36e37cc93b3d">
  <name>проф_СравненияОстатковРазница</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="0b3eadb6-5354-46e8-bc62-24f6ecd4fe8d">
    <name>Хранилище</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="68fb6f7c-b00f-4695-8cf2-1476eb049cba">
    <name>ПризнакРасхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="de549a95-b102-456b-950f-cbb43f30a4cb">
    <name>НомерПакета</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/InformationRegisters/проф_СравненияОстатковРазница/Forms/проф_ФормаЗаписи/Module.bsl
//++ Проф-ИТ, #398, Соловьев А.А., 18.12.2023

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьОтчет(Команда)
	
	ТабличныйДокумент = ДанныеИзХранилища(Запись.НомерПакета);
	Если ТабличныйДокумент = Неопределено Тогда 
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не найдены данные с номером сообщения %1'"), Запись.НомерПакета);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		ТабличныйДокумент.Показать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ДанныеИзХранилища(НомерПакета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	проф_СравненияОстатковРазница.Хранилище КАК Хранилище
	|ИЗ
	|	РегистрСведений.проф_СравненияОстатковРазница КАК проф_СравненияОстатковРазница
	|ГДЕ
	|	проф_СравненияОстатковРазница.НомерПакета = &НомерПакета";
	
	Запрос.УстановитьПараметр("НомерПакета", НомерПакета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеХранилища = Выборка.Хранилище;
		Возврат ДанныеХранилища.Получить();
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

//-- Проф-ИТ, #398, Соловьев А.А., 18.12.2023
